In [1]:
import numpy as np
import pandas as pd

In [6]:
dict = {'Company': ['COMP1', 'COMP1', 'COMP2', 'COMP2', 'COMP3', 'COMP3'],
        'Month': ['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN'],
        'Salary': [2000, 1500, 3000, 5000, 2500, 3500]}

In [7]:
df = pd.DataFrame(dict)

In [8]:
df

  Company Month  Salary
0   COMP1   JAN    2000
1   COMP1   FEB    1500
2   COMP2   MAR    3000
3   COMP2   APR    5000
4   COMP3   MAY    2500
5   COMP3   JUN    3500

In [9]:
df.groupby('Company')

In [10]:
df.groupby('Company').mean()

         Salary
Company
COMP1      1750
COMP2      4000
COMP3      3000

In [11]:
groupby_comp = df.groupby('Company')

In [12]:
groupby_comp.mean()

         Salary
Company
COMP1      1750
COMP2      4000
COMP3      3000

In [13]:
groupby_comp.sum()

         Salary
Company
COMP1      3500
COMP2      8000
COMP3      6000

In [14]:
groupby_comp.std()

              Salary
Company
COMP1     353.553391
COMP2    1414.213562
COMP3     707.106781

In [15]:
type(groupby_comp.sum())

pandas.core.frame.DataFrame

In [16]:
groupby_comp.sum().loc['COMP3']

Salary    6000
Name: COMP3, dtype: int64

In [17]:
df.groupby('Company').sum().loc['COMP3']

Salary    6000
Name: COMP3, dtype: int64

In [19]:
df.groupby('Company')

         Month  Salary
Company
COMP1        2       2
COMP2        2       2
COMP3        2       2

In [20]:
df

  Company Month  Salary
0   COMP1   JAN    2000
1   COMP1   FEB    1500
2   COMP2   MAR    3000
3   COMP2   APR    5000
4   COMP3   MAY    2500
5   COMP3   JUN    3500

In [21]:
df.groupby('Company').max()

        Month  Salary
Company
COMP1     JAN    2000
COMP2     MAR    5000
COMP3     MAY    3500

In [22]:
df.groupby('Company').min()

        Month  Salary
Company
COMP1     FEB    1500
COMP2     APR    3000
COMP3     JUN    2500

In [23]:
df.groupby('Company').describe()

        Salary
         count    mean          std     min     25%     50%     75%     max
Company
COMP1      2.0  1750.0   353.553391  1500.0  1625.0  1750.0  1875.0  2000.0
COMP2      2.0  4000.0  1414.213562  3000.0  3500.0  4000.0  4500.0  5000.0
COMP3      2.0  3000.0   707.106781  2500.0  2750.0  3000.0  3250.0  3500.0

In [24]:
df.groupby('Company').describe().transpose()

Company             COMP1        COMP2        COMP3
Salary count     2.000000     2.000000     2.000000
       mean   1750.000000  4000.000000  3000.000000
       std     353.553391  1414.213562   707.106781
       min    1500.000000  3000.000000  2500.000000
       25%    1625.000000  3500.000000  2750.000000
       50%    1750.000000  4000.000000  3000.000000
       75%    1875.000000  4500.000000  3250.000000
       max    2000.000000  5000.000000  3500.000000

In [26]:
comp2 = df.groupby('Company').describe().transpose()['COMP2']

In [27]:
comp2

Salary  count       2.000000
        mean     4000.000000
        std      1414.213562
        min      3000.000000
        25%      3500.000000
        50%      4000.000000
        75%      4500.000000
        max      5000.000000
Name: COMP2, dtype: float64

In [28]:
type(comp2)

pandas.core.series.Series